鉴于不少同学对互联网行业不是特别熟悉，在这里给大家讲讲互联网公司各工种及分工。

一、管理层
1.CEO：首席执行官，也就是老板啦，一般都是创世人担任，一些大公司会由职业经理人担任。
2.CTO：首席技术官，公司里所有技术部门的负责人（并非全部公司都有）
3.COO：首席运营官，公司里所有运营部门的负责人（并非全部公司都有）
4.CFO：首席财务官，公司里所有财务部门的负责人（并非全部公司都有）
4.VP：副总裁，分管公司一部分业务，辅助CEO
5.SVP：高级副总裁，大公司才有的职称，副总裁多了，也要分个高中低等

二、技术岗
1.技术总监：一般来说，小公司技术总监就是技术部门的负责人，稍微大些的公司会是一个业务线的技术负责人
2.架构师：负责整个公司或者整条业务线的架构设计，嗯，也是小公司没有的高端岗位
3.后端工程师：负责项目的服务器端部分，为前端提供数据支持，按使用的计算机语言分为PHP、JAVA、C++、Ruby、Python等等无数分类，近年比较火的数据挖掘也算这里。
4.前端工程师：负责项目的前端部分，即用户可以看到的界面，主流的包含Web、Android、iOS，还包括一些游戏公司专用的跨平台语言，如Cocos2d-x、Unity3D等
5.测试工程师：就是负责公司各个项目的测试啦，项目写完后是要提交测试的，测试不通过是不能上线的哦
6.运维工程师：管理公司各类设备，小公司的话更像网管，在大公司要管理公司全部的服务器，并不是大家想的那么简单

三、产品&设计岗
1.产品经理：负责整个产品的从立项到上线的全过程，具体工作不同的公司有不同的定义，核心职责是分析用户需求，通过产品解决该需求。进阶点的有高级产品经理和产品总监，入门的有产品助理。
2.游戏策划：你玩的那些游戏都是这帮人设计的，策划可以细分为数值策划、文案策划、执行策划等等，你在游戏里的一切经历都写在他们的Excel表里哦。
3.UI设计师：你们看到的各种产品的界面就是他们设计的啦，各个都是PS大师。
4.UE设计师：中到大型公司才有的岗位，负责用户体验、交互等的优化，小公司都是PM或者UI兼任
5.游戏美工：游戏公司画画的啦，分的也非常细，而且略专业，一般要艺术生

四、运营&市场岗
1.运营：运营是个很宽泛的概念，包括用户运营、产品运营、新媒体运营、商家运营等等一堆职业，总的来说就是通过运作某个事情，例如发微博，为公司最终的KPI服务。
2.编辑：就是写字的啦，各种写文章写帖子
3.市场：营销、推广等等
4.公关：塑造企业形象啦、买软文啦、黑对手啦

五、行政岗
1.财务：管钱滴，发工资就靠他们了
2.行政：公司的各种琐事都由她们处理
3.人力：又称HR，招聘、组织活动等等
4.前台：刚进公司看到的那个妹子就是啦
